## DataFrame
### 자료만 입력 & 컬럼 이름 추가

In [2]:
import pandas as pd
import numpy as np

# DataFrame
d = [0,1,2,3,4]
df = pd.DataFrame({"column1":d})
print(df)
print()
ds = pd.Series(d)
print(ds)
# 차이가 있다.

   column1
0        0
1        1
2        2
3        3
4        4

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [3]:
df["newCol"] = d
print(df)
df["newCol2"] = 5
print(df)

   column1  newCol
0        0       0
1        1       1
2        2       2
3        3       3
4        4       4
   column1  newCol  newCol2
0        0       0        5
1        1       1        5
2        2       2        5
3        3       3        5
4        4       4        5

In [4]:
df["newCol3"] = df["newCol2"]* 100
df

   column1  newCol  newCol2  newCol3
0        0       0        5      500
1        1       1        5      500
2        2       2        5      500
3        3       3        5      500
4        4       4        5      500

In [5]:
# 특정위치 데이터 바꾸기
print(df.iloc[1,2])
df.iloc[1,2] = 2000
df

5

   column1  newCol  newCol2  newCol3
0        0       0        5      500
1        1       1     2000      500
2        2       2        5      500
3        3       3        5      500
4        4       4        5      500

### 칼럼 제거하기 : 여러가지 방법 존재

#### del function

In [6]:
# 컬럼 제거 방법 1 : del function
print(df)
print()
del df["column1"]
print(df)

   column1  newCol  newCol2  newCol3
0        0       0        5      500
1        1       1     2000      500
2        2       2        5      500
3        3       3        5      500
4        4       4        5      500

   newCol  newCol2  newCol3
0       0        5      500
1       1     2000      500
2       2        5      500
3       3        5      500
4       4        5      500

### 필요한 칼럼 선택으로 간접 제거

In [7]:
# 칼럼 제거 방법 2 : multi-column select
print(df.columns.values)
newColList = [
    "newCol2",
    "newCol3"
]
print(newColList)
df

['newCol' 'newCol2' 'newCol3']
['newCol2', 'newCol3']

   newCol  newCol2  newCol3
0       0        5      500
1       1     2000      500
2       2        5      500
3       3        5      500
4       4        5      500

In [8]:
# 컬럼 제거 방법 3 : drop 메소드 사용
# axis : 0(row, 가로줄), 1(column, 세로줄)
print(df.drop("newCol", axis = 1))
print(df.drop(3, axis = 0))
# del function은 사용 즉시 df 원본에 적용 but drop method는 그 때만 한시적으로 적용

   newCol2  newCol3
0        5      500
1     2000      500
2        5      500
3        5      500
4        5      500
   newCol  newCol2  newCol3
0       0        5      500
1       1     2000      500
2       2        5      500
4       4        5      500

In [9]:
# index 이름
df.index.name = "Count"
df

       newCol  newCol2  newCol3
Count
0           0        5      500
1           1     2000      500
2           2        5      500
3           3        5      500
4           4        5      500

In [10]:
stock_price_DF_withIndex = pd.DataFrame(
    [10000, 10300, 9900, 10500, 11000],
    index = ["2016-03-01","2016-06-01","2016-09-01","2016-12-01","2017-03-01"])
stock_price_DF_withIndex

                0
2016-03-01  10000
2016-06-01  10300
2016-09-01   9900
2016-12-01  10500
2017-03-01  11000

In [11]:
# "0"을 "시가"로 컬럼명을 바꿔주세요.
# 0은 숫자로 되어있음. 주의해야함
stock_price_DF_withIndex.rename(columns = {0: "시가"}, inplace=True)


# column 추가(기존에 DF 데이터가 존재할 때 컬럼을 추가하는 경우) - 비어있는 DF인 경우에 컬럼추가하는 접근방법이 달라짐
tmp = [11000,12000,10000,13000,12000]
stock_price_DF_withIndex["종가"] = tmp
tmp = [13000,15000,15000, 18000, 17000]
stock_price_DF_withIndex["고가"] = tmp
tmp = [3000,5000,5000,8000,7000]
stock_price_DF_withIndex["저가"] = tmp

stock_price_DF_withIndex

               시가     종가     고가    저가
2016-03-01  10000  11000  13000  3000
2016-06-01  10300  12000  15000  5000
2016-09-01   9900  10000  15000  5000
2016-12-01  10500  13000  18000  8000
2017-03-01  11000  12000  17000  7000

In [12]:
# number를 가지고 데이터에 접근할 때
stock_price_DF_withIndex.iat[0,0]

10000

In [15]:
# 특정 index의 특정 칼럼 접근
print(stock_price_DF_withIndex.loc["2016-03-01",["시가","종가"]])

시가    10000
종가    11000
Name: 2016-03-01, dtype: int64

In [18]:
# slicing도 가능
print(stock_price_DF_withIndex.loc["2016-03-01":"2016-12","시가": "고가"])

               시가     종가     고가
2016-03-01  10000  11000  13000
2016-06-01  10300  12000  15000
2016-09-01   9900  10000  15000

In [19]:
# 기타 내용 - 축 바꾸기(가로, 세로 바꾸기) - 별로 사용 안함
stock_price_DF_withIndex.T

    2016-03-01  2016-06-01  2016-09-01  2016-12-01  2017-03-01
시가       10000       10300        9900       10500       11000
종가       11000       12000       10000       13000       12000
고가       13000       15000       15000       18000       17000
저가        3000        5000        5000        8000        7000

In [21]:
# 기타 내용
stock_price_DF_withIndex.values
# array로 반환

array([[10000, 11000, 13000,  3000],
       [10300, 12000, 15000,  5000],
       [ 9900, 10000, 15000,  5000],
       [10500, 13000, 18000,  8000],
       [11000, 12000, 17000,  7000]], dtype=int64)

In [22]:
stock_price_DF_withIndex.shape # (rows, columns)

(5, 4)

In [25]:
print(stock_price_DF_withIndex.shape[0]) # rows
print(stock_price_DF_withIndex.shape[1]) # columns

5
4

### DF: reindex

In [26]:
# reindex
obj = pd.Series([4.5,7.2,-5.3], index=["c","b","a"])
obj

c    4.5
b    7.2
a   -5.3
dtype: float64

In [30]:
obj2 = obj.reindex(["a","b"])
obj2
# 원본은 안바뀜

a   -5.3
b    7.2
dtype: float64

In [32]:
obj3 = obj.reindex(["a","b","c","d","e"])
obj3
# 없는 index를 reindex하면 NaN으로 지정

a   -5.3
b    7.2
c    4.5
d    NaN
e    NaN
dtype: float64

In [34]:
obj.reindex(["a","b","c","d","e"], fill_value=0)
# NaN값을 0으로 대체

a   -5.3
b    7.2
c    4.5
d    0.0
e    0.0
dtype: float64

### 실질적으로 "보간법"으로 처리하는 경우도 많다.

In [40]:
# 보간법
# NaN을 대체할 때 0이나 고정된 값으로 하기엔 문제가 있음
obj = pd.Series([4.5,7.2,-5.3], index=["c","b","a"])
print(obj)
print()
print(obj.reindex(["a","d","e","c","b"]))
print()
# 보간법에 대한 method
# 중간에 비어있는 값을 동일한 간격으로 값을 준다.
print(obj.reindex(["a","d","e","c","b"]).interpolate())

c    4.5
b    7.2
a   -5.3
dtype: float64

a   -5.3
d    NaN
e    NaN
c    4.5
b    7.2
dtype: float64

a   -5.300000
d   -2.033333
e    1.233333
c    4.500000
b    7.200000
dtype: float64

In [48]:
obj = pd.DataFrame([4.5,7.2,-5.3], index=["c","b","a"])
obj = obj.reindex(["a","d","e","c","b"])
print(obj)
obj["InterPol"] = obj.iloc[:,0].interpolate()
print(obj)

     0
a -5.3
d  NaN
e  NaN
c  4.5
b  7.2
     0  InterPol
a -5.3 -5.300000
d  NaN -2.033333
e  NaN  1.233333
c  4.5  4.500000
b  7.2  7.200000

### 그렇다면 interpolate할 때 각 양끝단이 정해진것이 아니라 처음부터 NaN이면 어떻게 할 것인가?